os/paperwork/exam-outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《操作系统原理》考试大纲</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《操作系统原理》考试大纲"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-30 Fri"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《操作系统原理》考试大纲</h1>

<ul>
<li>课程名称：操作系统原理
</li>
<li>任课教师：王晓林
</li>
<li>适应专业：电信、计算机等本科专业
</li>
<li>授课学时：64
</li>
<li>考试方式：闭卷笔试
</li>
<li>命题规则：按《西南林学院考试命题规则》(试行)(1996年10月修订)执行
</li>
<li>考试时间：120分钟
</li>
<li>推荐教材：
<ol>
<li>A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
</li>
<li>Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley &amp; Sons, 2011.
</li>
</ol>

</li>
<li>课程性质及教学目的：本课程为计算机专业本科专业基础课。要求学生全面了解操作系统的工作原理。
</li>
</ul>


<p>  
各章节考核目标如下：
</p>
<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 操作系统简介</a>
<ul>
<li><a href="#sec-1-1">1.1 考核知识点</a></li>
<li><a href="#sec-1-2">1.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-2">2 进程与线程</a>
<ul>
<li><a href="#sec-2-1">2.1 考核知识点</a></li>
<li><a href="#sec-2-2">2.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-3">3 进程间同步</a>
<ul>
<li><a href="#sec-3-1">3.1 考核知识点</a></li>
<li><a href="#sec-3-2">3.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-4">4 CPU调度</a>
<ul>
<li><a href="#sec-4-1">4.1 考核知识点</a></li>
<li><a href="#sec-4-2">4.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-5">5 死锁</a>
<ul>
<li><a href="#sec-5-1">5.1 考核知识点</a></li>
<li><a href="#sec-5-2">5.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-6">6 内存管理</a>
<ul>
<li><a href="#sec-6-1">6.1 考核知识点</a></li>
<li><a href="#sec-6-2">6.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-7">7 文件系统</a>
<ul>
<li><a href="#sec-7-1">7.1 考核知识点</a></li>
<li><a href="#sec-7-2">7.2 考核要求</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 操作系统简介</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>What's an OS?
</li>
<li>OS services
</li>
<li>Bootstrapping
</li>
<li>Hardware
</li>
<li>Interrupt
</li>
<li>System calls    
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>了解什么是操作系统
</li>
<li>了解操作系统提供哪些服务
</li>
<li>了解计算机启动的过程
</li>
<li>了解什么是中断
</li>
<li>了解什么是system call
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 进程与线程</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>What's a process?
</li>
<li>Process creation
</li>
<li>Process state
</li>
<li>Process Control Block (PCB)
</li>
<li>CPU switch from process to process
</li>
<li>Processes vs. threads
</li>
<li>Why threads?
</li>
<li>Thread characteristics
</li>
<li>Thread operation and POSIX threads
</li>
<li>User-level threads vs. kernel-level threads
</li>
<li>Linux threads
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>了解什么是进程
</li>
<li>了解进程的创建和进程的状态变化
</li>
<li>了解什么是PCB
</li>
<li>了解CPU切换的过程
</li>
<li>了解什么是线程，线程的特点，及相关操作
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 进程间同步</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>Concepts
</li>
<li>Shared memory
</li>
<li>Race condition and mutual exclusion
</li>
<li>Semaphores
</li>
<li>Monitors
</li>
<li>Message passing
</li>
<li>Classical IPC problems
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>了解进程间同步的概念
</li>
<li>了解共享内存的工作原理
</li>
<li>了解进程间冲突的处理方式
</li>
<li>了解什么是信号量，及其工作机制
</li>
<li>了解什么是消息传递，及其工作过程
</li>
<li>了解经典的IPC问题及解决方案
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> CPU调度</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>Scheduling introduction
</li>
<li>Scheduling algorithms
</li>
<li>Thread scheduling
</li>
<li>Linux scheduling    
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>了解什么是调度
</li>
<li>了解各种调度算法
</li>
<li>了解线程的调度
</li>
<li>了解Linux系统的调度机制
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 死锁</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>Resources
</li>
<li>Introduction to deadlocks
</li>
<li>Deadlock modeling
</li>
<li>Dealing with deadlocks
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>了解什么是死锁
</li>
<li>了解死锁的处理机制
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 内存管理</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>Real-mode vs. protected-mode memory management
</li>
<li>Contiguous memory allocation
</li>
<li>Virtual memory
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li>了解什么是虚拟内存
</li>
<li>了解分页内存管理机制
</li>
<li>了解页替换算法
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 文件系统</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>Files
</li>
<li>Directories
</li>
<li>File system implementation
</li>
<li>Ext2 file system
</li>
<li>Virtual file system
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li>了解文件及目录的概念
</li>
<li>了解文件的实现方式
</li>
<li>了解ext2文件系统的工作原理
</li>
<li>了解什么是虚拟文件系统，及其工作原理
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2012-11-30 Fri</p>

</div>
</body>
</html>
